// =============== ЛЕКЦИОННЫЕ ЗАДАЧИ ===============
const lectureTasks = [
    { sec: "🔹 1. Ввод и вывод", txt: "Напишите программу, которая спрашивает имя пользователя и приветствует его:\nПривет, [Имя]!" },
    { sec: "🔹 1. Ввод и вывод", txt: "Запросите два числа и выведите их сумму." },
    { sec: "🔹 1. Ввод и вывод", txt: "Спросите у пользователя длину и ширину прямоугольника. Выведите площадь и периметр." },
    { sec: "🔹 1. Ввод и вывод", txt: "Спросите у пользователя температуру в градусах Цельсия. Выведите её в Фаренгейтах:\nF = C * 9/5 + 32" },
  
    { sec: "🔹 2. Условия → Простые условия", txt: "Проверьте, чётное ли число (введённое пользователем)." },
    { sec: "🔹 2. Условия → Простые условия", txt: "Сравните два числа и выведите, какое больше, поменяйте местами." },
    { sec: "🔹 2. Условия → Простые условия", txt: "Проверьте, делится ли число на 3 без остатка." },
    { sec: "🔹 2. Условия → Простые условия", txt: "Проверьте, является ли символ гласной буквой (русской или английской)." },
  
    { sec: "🔹 2. Условия → Составные условия", txt: "Проверьте, попадает ли число в диапазон от 10 до 100 включительно." },
    { sec: "🔹 2. Условия → Составные условия", txt: "Проверьте, является ли год високосным:\n- делится на 4\n- но не делится на 100, если не делится на 400" },
  
    { sec: "🔹 3. Циклы → Цикл for", txt: "Выведите все числа от 1 до N (N вводит пользователь)." },
    { sec: "🔹 3. Циклы → Цикл for", txt: "Выведите все чётные числа от 1 до N." },
    { sec: "🔹 3. Циклы → Цикл for", txt: "Посчитайте сумму чисел от 1 до N." },
    { sec: "🔹 3. Циклы → Цикл for", txt: "Выведите таблицу умножения на число K (например, на 7)." },
    { sec: "🔹 3. Циклы → Цикл for", txt: "Нарисуйте \"ёлочку\" из звёздочек высотой N:\n\n*\n**\n***" },
  
    { sec: "🔹 3. Циклы → Цикл while", txt: "Пользователь вводит числа, пока не введёт 0. Посчитайте сумму всех чисел." },
    { sec: "🔹 3. Циклы → Цикл while", txt: "Угадай число: программа загадывает число от 1 до 100, пользователь угадывает. Давайте подсказки: «больше» / «меньше»." },
    { sec: "🔹 3. Циклы → Цикл while", txt: "Выведите степени двойки, пока результат ≤ 1000." },
  
    { sec: "🔹 4. Работа со строками → Базовые операции", txt: "Выведите строку задом наперёд." },
    { sec: "🔹 4. Работа со строками → Базовые операции", txt: "Посчитайте количество символов в строке (без len — через цикл)." },
    { sec: "🔹 4. Работа со строками → Базовые операции", txt: "Преобразуйте строку в верхний/нижний регистр." },
    { sec: "🔹 4. Работа со строками → Базовые операции", txt: "Удалите все пробелы в начале и конце строки." },
    { sec: "🔹 4. Работа со строками → Базовые операции", txt: "Замените все пробелы на подчёркивания." },
  
    { sec: "🔹 4. Работа со строками → Анализ текста", txt: "Посчитайте количество гласных букв в строке (русские и английские)." },
    { sec: "🔹 4. Работа со строками → Анализ текста", txt: "Посчитайте количество слов в строке (разделены пробелами)." },
    { sec: "🔹 4. Работа со строками → Анализ текста", txt: "Найдите самое длинное слово в предложении." },
    { sec: "🔹 4. Работа со строками → Анализ текста", txt: "Проверьте, является ли строка палиндромом (например, «топот», «А роза упала на лапу Азора» — игнорируя пробелы и регистр)." },
    { sec: "🔹 4. Работа со строками → Анализ текста", txt: "Посчитайте, сколько раз встречается буква «а» в тексте." }
  ];
  
  // =============== ПРАКТИЧЕСКИЕ ЗАДАЧИ ===============
  const practiceTasks = [
    { sec: "🔹 Практика 1. Ввод и вывод", txt: "Спросите у пользователя имя, возраст и город. Выведите всё одной строкой:\nМеня зовут [Имя], мне [возраст] лет, я живу в [Город]." },
    { sec: "🔹 Практика 1. Ввод и вывод", txt: "Напишите программу, которая запрашивает стоимость товара и количество → выводит итоговую сумму и надпись:\nК оплате: [сумма] руб." },
  
    { sec: "🔹 Практика 2. Условия → Простые условия", txt: "Проверьте, чётное ли число (введённое пользователем)." },
    { sec: "🔹 Практика 2. Условия → Простые условия", txt: "Определите, положительное ли число, отрицательное или ноль." },
    { sec: "🔹 Практика 2. Условия → Простые условия", txt: "Сравните два числа и выведите, какое больше." },
    { sec: "🔹 Практика 2. Условия → Простые условия", txt: "Проверьте, делится ли число на 3 без остатка." },
    { sec: "🔹 Практика 2. Условия → Простые условия", txt: "Проверьте, является ли символ гласной буквой (русской или английской)." },
  
    { sec: "🔹 Практика 2. Условия → Составные условия", txt: "Пользователь вводит возраст. Выведите:\n- < 18 → «Несовершеннолетний»\n- 18–60 → «Взрослый»\n- > 60 → «Пенсионер»" },
    { sec: "🔹 Практика 2. Условия → Составные условия", txt: "Проверьте, может ли существовать треугольник с заданными сторонами a, b, c (сумма любых двух > третьей)." },
    { sec: "🔹 Практика 2. Условия → Составные условия", txt: "Проверьте, является ли введённый символ цифрой, буквой или спецсимволом." },
  
    { sec: "🔹 Практика 2. Условия → Многоуровневые условия", txt: "Калькулятор: пользователь вводит два числа и операцию (+, -, *, /). Выполните операцию. Обработайте деление на ноль." },
    { sec: "🔹 Практика 2. Условия → Многоуровневые условия", txt: "Определите категорию транспортного средства по скорости:\n- < 30 → «Пешеход»\n- 30–60 → «Велосипед/мотоцикл»\n- 60–120 → «Автомобиль»\n- > 120 → «Самолёт? 😲»" },
  
    { sec: "🔹 Практика 3. Циклы → Цикл for", txt: "Выведите таблицу умножения на число K (например, на 7)." },
    { sec: "🔹 Практика 3. Циклы → Цикл for", txt: "Выведите квадраты чисел от 1 до 10." },
    { sec: "🔹 Практика 3. Циклы → Цикл for", txt: "Для списка [10, 20, 30, 40, 50] выведите каждый элемент с номером:\n1: 10, 2: 20, ..." },
  
    { sec: "🔹 Практика 3. Циклы → Цикл while", txt: "Проверьте, сколько раз нужно умножить число на 2, чтобы оно стало ≥ 1000." },
  
    { sec: "🔹 Практика 3. Циклы → Смешанные", txt: "Найдите факториал числа N." },
    { sec: "🔹 Практика 3. Циклы → Смешанные", txt: "Посчитайте количество цифр в числе (без перевода в строку!)." },
  
    { sec: "🔹 Практика 4. Работа со строками → Анализ текста", txt: "Посчитайте количество гласных букв в строке (русские и английские)." },
    { sec: "🔹 Практика 4. Работа со строками → Анализ текста", txt: "Посчитайте количество слов в строке (разделены пробелами)." },
    { sec: "🔹 Практика 4. Работа со строками → Анализ текста", txt: "Найдите самое длинное слово в предложении." },
    { sec: "🔹 Практика 4. Работа со строками → Анализ текста", txt: "Проверьте, является ли строка палиндромом (например, «топот», «А роза упала на лапу Азора» — игнорируя пробелы и регистр)." },
    { sec: "🔹 Практика 4. Работа со строками → Анализ текста", txt: "Посчитайте, сколько раз встречается буква «а» в тексте." },
  
    { sec: "🔹 Практика 4. Работа со строками → Преобразования", txt: "Разбейте строку на слова и выведите каждое с новой строки." },
    { sec: "🔹 Практика 4. Работа со строками → Преобразования", txt: "Соберите строку из списка слов, разделённых запятой." },
    { sec: "🔹 Практика 4. Работа со строками → Преобразования", txt: "Зашифруйте строку: замените каждую букву на следующую в алфавите («а» → «б», «я» → «а»)." },
    { sec: "🔹 Практика 4. Работа со строками → Преобразования", txt: "Удалите все цифры из строки." },
    { sec: "🔹 Практика 4. Работа со строками → Преобразования", txt: "Оставьте только буквы и пробелы (удалите знаки препинания)." },
  
    { sec: "🔹 Практика 4. Работа со строками → Мини-проекты", txt: "Цензура: замените слово «плохо» на «***» в тексте." },
    { sec: "🔹 Практика 4. Работа со строками → Мини-проекты", txt: "Форматирование номера телефона:\nВвод: 89123456789 → Вывод: +7 (912) 345-67-89" },
    { sec: "🔹 Практика 4. Работа со строками → Мини-проекты", txt: "Подсчёт статистики:\nВведите текст → программа выводит:\n- количество слов\n- количество предложений (по точкам)\n- средняя длина слова" },
    { sec: "🔹 Практика 4. Работа со строками → Мини-проекты", txt: "Поиск по ключевому слову:\nПользователь вводит текст и слово → программа говорит, есть ли оно в тексте." },
    { sec: "🔹 Практика 4. Работа со строками → Мини-проекты", txt: "Генератор паролей:\nСпросите длину → сгенерируйте случайную строку из букв и цифр." }
  ];
  
  // =============== ПОДСКАЗКИ ===============
  const practiceHints = [
    "Используйте f-строку: f'Меня зовут {name}, мне {age} лет...'",
    "Спросите цену и количество, умножьте их, выведите с надписью.",
    "Остаток от деления на 2 равен 0?",
    "Сравните число с нулём с помощью if/elif/else.",
    "Используйте оператор > для сравнения.",
    "Проверьте остаток от деления на 3.",
    "Гласные: a, e, i, o, u и их русские аналоги. Используйте in.",
    "Используйте цепочку условий: if age < 18 ... elif age <= 60 ...",
    "Проверьте: a + b > c и a + c > b и b + c > a",
    "Используйте isdigit(), isalpha() или сравнение с диапазонами символов.",
    "Сначала проверьте операцию, затем деление на ноль.",
    "Используйте цепочку if/elif по диапазонам скорости.",
    "Используйте цикл for i in range(1, 11): print(f'{K} x {i} = {K*i}')",
    "Цикл for с возведением в степень: i**2",
    "Используйте enumerate() или range(len(list)) для номеров.",
    "Умножайте число на 2 в цикле while, пока оно < 1000. Считайте шаги.",
    "Факториал: 1 * 2 * 3 * ... * N. Используйте цикл.",
    "Делите число на 10 в цикле, пока оно не станет 0. Считайте итерации.",
    "Пройдитесь по строке циклом и проверяйте каждую букву.",
    "Разбейте строку через .split() и посчитайте длину списка.",
    "Разбейте на слова, сравнивайте длину каждого.",
    "Уберите пробелы, приведите к нижнему регистру, сравните с обратной версией.",
    "Используйте цикл и счётчик для буквы 'а'.",
    "Используйте .split() и цикл for с print().",
    "Используйте ', '.join(list_of_words)",
    "Пройдитесь по символам, найдите индекс в алфавите, возьмите следующий.",
    "Соберите новую строку, проверяя каждый символ через isdigit().",
    "Оставляйте только символы, для которых char.isalpha() или char == ' '",
    "Используйте .replace('плохо', '***')",
    "Разбейте строку на части: код, первые 3 цифры и т.д. Используйте срезы.",
    "Разбейте на предложения через '.', на слова через пробел. Считайте.",
    "Используйте in: if word in text: ...",
    "Используйте random.choice() из строки с буквами и цифрами в цикле."
  ];
  
  // =============== ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ ===============
  let currentMode = 'lecture';
  let currentIndex = 0;
  
  // Система бейджей
  const badges = [
    { name: "Новичок", icon: "🔰", threshold: 5 },
    { name: "Кодер", icon: "💻", threshold: 10 },
    { name: "Аналитик", icon: "📊", threshold: 15 },
    { name: "Инженер", icon: "⚙️", threshold: 20 },
    { name: "Мастер Python", icon: "🐍", threshold: 25 }
  ];
  
  let practiceProgress = parseInt(localStorage.getItem('practiceProgress') || '0');
  
  // =============== ФУНКЦИИ ===============
  function updateUI() {
    const total = currentMode === 'lecture' ? lectureTasks.length : practiceTasks.length;
    const current = currentIndex + 1;
    const modeName = currentMode === 'lecture' ? 'Лекции' : 'Практика';
    
    document.getElementById('progressInfo').textContent = 
      `Режим: ${modeName} • Задание ${current} из ${total}`;
    
    const percent = total > 0 ? Math.round((current / total) * 100) : 0;
    document.getElementById('ringLabel').textContent = `${percent}%`;
    
    const dashArray = 314;
    const dashOffset = dashArray - (dashArray * percent) / 100;
    document.getElementById('progressRing').style.strokeDashoffset = dashOffset;
    
    const btn = document.getElementById('toggleMode');
    btn.textContent = currentMode === 'lecture' 
      ? '→ Перейти к практическим заданиям' 
      : '← Вернуться к лекционным заданиям';
  }
  
  function renderTask() {
    const container = document.getElementById('tasksContainer');
    container.innerHTML = '';
  
    const tasks = currentMode === 'lecture' ? lectureTasks : practiceTasks;
    const task = tasks[currentIndex];
  
    const taskEl = document.createElement('div');
    taskEl.className = 'task active';
  
    let hintHtml = '';
    if (currentMode === 'practice') {
      hintHtml = `
        <button class="hint-btn" onclick="toggleHint(${currentIndex})">Показать подсказку</button>
        <div class="hint-box" id="hintBox" style="display:none;"></div>
      `;
    }
  
    taskEl.innerHTML = `
      <div class="section-title">${task.sec}</div>
      <div class="task-title">Задание ${currentIndex + 1}</div>
      <div class="task-text">${task.txt}</div>
      ${hintHtml}
      <button class="next-btn" onclick="nextTask()">Следующее задание</button>
    `;
  
    container.appendChild(taskEl);
    updateUI();
  }
  
  function nextTask() {
    const tasks = currentMode === 'lecture' ? lectureTasks : practiceTasks;
    if (currentIndex < tasks.length - 1) {
      currentIndex++;
      renderTask();
      
      if (currentMode === 'practice') {
        checkNewBadge(currentIndex + 1);
      }
    } else {
      const ringWrapper = document.querySelector('.progress-ring-wrapper');
      startConfetti(ringWrapper);
      
      const modeName = currentMode === 'lecture' ? 'лекций' : 'практических заданий';
      alert(`✅ Поздравляем! Вы завершили все ${modeName}!`);
      
      if (currentMode === 'practice') {
        checkNewBadge(tasks.length);
      }
    }
  }
  
  function toggleMode() {
    currentMode = currentMode === 'lecture' ? 'practice' : 'lecture';
    currentIndex = 0;
    renderTask();
    
    if (currentMode === 'practice') {
      practiceProgress = parseInt(localStorage.getItem('practiceProgress') || '0');
    }
  }
  
  function goToTask() {
    const input = document.getElementById('taskNumber');
    const value = parseInt(input.value.trim(), 10);
    
    if (isNaN(value)) {
      alert("Введите число!");
      return;
    }
  
    const tasks = currentMode === 'lecture' ? lectureTasks : practiceTasks;
    const total = tasks.length;
  
    if (value < 1 || value > total) {
      alert(`Номер должен быть от 1 до ${total}`);
      return;
    }
  
    currentIndex = value - 1;
    renderTask();
    
    if (currentMode === 'practice') {
      const newProgress = currentIndex + 1;
      if (newProgress > practiceProgress) {
        checkNewBadge(newProgress);
      } else {
        practiceProgress = newProgress;
        localStorage.setItem('practiceProgress', practiceProgress.toString());
      }
    }
    
    input.value = '';
  }
  
  function toggleHint(index) {
    const hintBox = document.getElementById('hintBox');
    const hint = practiceHints[index];
    if (hintBox.style.display === 'block') {
      hintBox.style.display = 'none';
      hintBox.textContent = '';
    } else {
      hintBox.style.display = 'block';
      hintBox.textContent = hint;
    }
  }
  
  // === БЕЙДЖИ ===
  function checkNewBadge(newProgress) {
    localStorage.setItem('practiceProgress', newProgress.toString());
    
    const lastUnlocked = badges.filter(b => practiceProgress < b.threshold && newProgress >= b.threshold);
    
    if (lastUnlocked.length > 0) {
      const newBadge = lastUnlocked[lastUnlocked.length - 1];
      setTimeout(() => showBadge(newBadge), 300);
    }
    
    practiceProgress = newProgress;
  }
  
  function showBadge(badge) {
    document.getElementById('badgeIcon').textContent = badge.icon;
    document.getElementById('badgeName').textContent = badge.name;
    document.getElementById('badgeModal').style.display = 'flex';
    setTimeout(closeBadge, 5000);
  }
  
  function closeBadge() {
    document.getElementById('badgeModal').style.display = 'none';
  }
  
  // === КОНФЕТТИ ===
  function startConfetti(centerElement) {
    const canvas = document.getElementById('confettiCanvas');
    const ctx = canvas.getContext('2d');
    canvas.style.display = 'block';
    canvas.width = window.innerWidth;
    canvas.height = window.innerHeight;
    
    const rect = centerElement.getBoundingClientRect();
    const centerX = rect.left + rect.width / 2;
    const centerY = rect.top + rect.height / 2;
    
    const confettiCount = 150;
    const gravity = 0.2;
    const colors = ['#FF6F00', '#FFD700', '#4fc3f7', '#00e676', '#ff4081'];
    
    let confetti = [];
    for (let i = 0; i < confettiCount; i++) {
      confetti.push({
        x: centerX,
        y: centerY,
        angle: Math.random() * Math.PI * 2,
        speed: 2 + Math.random() * 5,
        size: 6 + Math.random() * 8,
        color: colors[Math.floor(Math.random() * colors.length)],
        rotation: Math.random() * 360,
        rotationSpeed: -5 + Math.random() * 10
      });
    }
    
    function animate() {
      ctx.clearRect(0, 0, canvas.width, canvas.height);
      let alive = false;
      for (let i = 0; i < confetti.length; i++) {
        const c = confetti[i];
        c.y += Math.sin(c.angle) * c.speed;
        c.x += Math.cos(c.angle) * c.speed;
        c.speed *= 0.99;
        c.angle += 0.02;
        c.rotation += c.rotationSpeed;
        c.y += gravity;
        
        ctx.save();
        ctx.translate(c.x, c.y);
        ctx.rotate(c.rotation * Math.PI / 180);
        ctx.fillStyle = c.color;
        ctx.fillRect(-c.size/2, -c.size/2, c.size, c.size);
        ctx.restore();
        
        if (c.y < canvas.height + 50) alive = true;
      }
      
      if (alive) {
        requestAnimationFrame(animate);
      } else {
        canvas.style.display = 'none';
      }
    }
    
    animate();
    setTimeout(() => canvas.style.display = 'none', 4000);
  }
  
  // =============== ЗМЕЙКА ===============
  let snakeGame = null;
  
  function startBreak() {
    document.getElementById('snakeModal').style.display = 'flex';
    
    if (!snakeGame) {
      initSnakeGame();
    }
    snakeGame.start();
  }
  
  function closeSnake() {
    document.getElementById('snakeModal').style.display = 'none';
    if (snakeGame) {
      snakeGame.stop();
    }
  }
  
  function initSnakeGame() {
    const canvas = document.getElementById('snakeCanvas');
    const ctx = canvas.getContext('2d');
    const scoreEl = document.getElementById('score');
    const highScoreEl = document.getElementById('highScore');
    
    const gridSize = 15;
    const gridWidth = Math.floor(canvas.width / gridSize);
    const gridHeight = Math.floor(canvas.height / gridSize);
    
    let snake = [];
    let food = {};
    let direction = 'right';
    let nextDirection = 'right';
    let score = 0;
    let gameInterval = null;
    let isRunning = false;
    
    let highScore = parseInt(localStorage.getItem('snakeHighScore') || '0');
    highScoreEl.textContent = highScore;
  
    function resetGame() {
      snake = [
        {x: 5, y: 10},
        {x: 4, y: 10},
        {x: 3, y: 10}
      ];
      generateFood();
      direction = 'right';
      nextDirection = 'right';
      score = 0;
      scoreEl.textContent = score;
      draw();
    }
  
    function generateFood() {
      food = {
        x: Math.floor(Math.random() * gridWidth),
        y: Math.floor(Math.random() * gridHeight)
      };
      for (let segment of snake) {
        if (segment.x === food.x && segment.y === food.y) {
          return generateFood();
        }
      }
    }
  
    function draw() {
      ctx.fillStyle = '#0a0a0a';
      ctx.fillRect(0, 0, canvas.width, canvas.height);
      
      ctx.fillStyle = '#4fc3f7';
      for (let segment of snake) {
        ctx.fillRect(segment.x * gridSize, segment.y * gridSize, gridSize - 1, gridSize - 1);
      }
      
      ctx.fillStyle = '#FF6F00';
      ctx.fillRect(food.x * gridSize, food.y * gridSize, gridSize - 1, gridSize - 1);
    }
  
    function update() {
      direction = nextDirection;
      
      const head = {...snake[0]};
      switch (direction) {
        case 'up': head.y--; break;
        case 'down': head.y++; break;
        case 'left': head.x--; break;
        case 'right': head.x++; break;
      }
      
      // Столкновение со стеной
      if (head.x < 0 || head.x >= gridWidth || head.y < 0 || head.y >= gridHeight) {
        gameOver();
        return;
      }
      
      // Столкновение с собой
      for (let i = 0; i < snake.length; i++) {
        if (snake[i].x === head.x && snake[i].y === head.y) {
          gameOver();
          return;
        }
      }
      
      snake.unshift(head);
      
      // Съела еду?
      if (head.x === food.x && head.y === food.y) {
        score += 10;
        scoreEl.textContent = score;
        generateFood();
      } else {
        snake.pop();
      }
      
      draw();
    }
  
    function gameOver() {
      stop();
      if (score > highScore) {
        highScore = score;
        localStorage.setItem('snakeHighScore', highScore.toString());
        highScoreEl.textContent = highScore;
      }
      // Игра просто останавливается — перезапуск по кнопке
    }
  
    function start() {
      stop(); // Убедиться, что старая игра остановлена
      resetGame();
      isRunning = true;
      gameInterval = setInterval(update, 120);
    }
  
    function stop() {
      if (gameInterval) {
        clearInterval(gameInterval);
        gameInterval = null;
      }
      isRunning = false;
    }
  
    function handleKey(e) {
      if (!isRunning) return;
      switch (e.key) {
        case 'ArrowUp': if (direction !== 'down') nextDirection = 'up'; break;
        case 'ArrowDown': if (direction !== 'up') nextDirection = 'down'; break;
        case 'ArrowLeft': if (direction !== 'right') nextDirection = 'left'; break;
        case 'ArrowRight': if (direction !== 'left') nextDirection = 'right'; break;
      }
    }
  
    // Удаляем предыдущий обработчик, если он был
    if (window.snakeKeyHandler) {
      window.removeEventListener('keydown', window.snakeKeyHandler);
    }
    window.snakeKeyHandler = handleKey;
    window.addEventListener('keydown', handleKey);
  
    snakeGame = { start, stop };
  }
  
  // === ИНИЦИАЛИЗАЦИЯ ===
  document.addEventListener('DOMContentLoaded', () => {
    document.getElementById('toggleMode').addEventListener('click', toggleMode);
    
    const taskInput = document.getElementById('taskNumber');
    taskInput.addEventListener('keypress', (e) => {
      if (e.key === 'Enter') {
        goToTask();
      }
    });
  
    document.addEventListener('keydown', (e) => {
      if (e.key === 'Escape' && document.getElementById('snakeModal').style.display === 'flex') {
        closeSnake();
      }
    });
  
    renderTask();
  });